In [38]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Practise').getOrCreate()

In [39]:
df_pyspark=spark.read.csv('/Users/macbookpro/Desktop/Pyspark-With-Python-main/test2_example.csv',header=True,inferSchema=True)

In [40]:
df_pyspark.show()

+-----+----+----------+------+
| Name| age|Experience|Salary|
+-----+----+----------+------+
|mahsa|  31|        10| 30000|
| sara|  30|         8| 25000|
| mina|  29|         4| 20000|
|sahar|  24|         3| 20000|
| homa|  21|         1| 15000|
|shima|  23|         2| 18000|
| sima|null|      null| 40000|
| null|  34|        10| 38000|
| null|  36|      null|  null|
+-----+----+----------+------+

In [41]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [42]:
df_pyspark.drop('Name').show()

+----+----------+------+
| age|Experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 20000|
|  21|         1| 15000|
|  23|         2| 18000|
|null|      null| 40000|
|  34|        10| 38000|
|  36|      null|  null|
+----+----------+------+

In [43]:
df_pyspark.show()

+-----+----+----------+------+
| Name| age|Experience|Salary|
+-----+----+----------+------+
|mahsa|  31|        10| 30000|
| sara|  30|         8| 25000|
| mina|  29|         4| 20000|
|sahar|  24|         3| 20000|
| homa|  21|         1| 15000|
|shima|  23|         2| 18000|
| sima|null|      null| 40000|
| null|  34|        10| 38000|
| null|  36|      null|  null|
+-----+----+----------+------+

In [44]:
df_pyspark.na.drop().show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
+-----+---+----------+------+

In [45]:
df_pyspark.dropna().show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
+-----+---+----------+------+

In [46]:
#how=any --> drop row that there is null -->by default
#‘any’ or ‘all’. If ‘any’, drop a row if it contains any nulls. If ‘all’, drop a row only if all its values are null.
df_pyspark.na.drop(how="any").show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
+-----+---+----------+------+

In [47]:
#how="all" --> drop row that all null
df_pyspark.na.drop(how="all").show()

+-----+----+----------+------+
| Name| age|Experience|Salary|
+-----+----+----------+------+
|mahsa|  31|        10| 30000|
| sara|  30|         8| 25000|
| mina|  29|         4| 20000|
|sahar|  24|         3| 20000|
| homa|  21|         1| 15000|
|shima|  23|         2| 18000|
| sima|null|      null| 40000|
| null|  34|        10| 38000|
| null|  36|      null|  null|
+-----+----+----------+------+

In [48]:
#threshold  
df_pyspark.na.drop(how="any",thresh=3).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
| null| 34|        10| 38000|
+-----+---+----------+------+

In [49]:
#drop row that two non null-value
#default None If specified, drop rows that have less than thresh non-null values.
df_pyspark.na.drop(how="any",thresh=2).show()

+-----+----+----------+------+
| Name| age|Experience|Salary|
+-----+----+----------+------+
|mahsa|  31|        10| 30000|
| sara|  30|         8| 25000|
| mina|  29|         4| 20000|
|sahar|  24|         3| 20000|
| homa|  21|         1| 15000|
|shima|  23|         2| 18000|
| sima|null|      null| 40000|
| null|  34|        10| 38000|
+-----+----+----------+------+

In [50]:
df_pyspark.na.drop(how="any",thresh=1).show()

+-----+----+----------+------+
| Name| age|Experience|Salary|
+-----+----+----------+------+
|mahsa|  31|        10| 30000|
| sara|  30|         8| 25000|
| mina|  29|         4| 20000|
|sahar|  24|         3| 20000|
| homa|  21|         1| 15000|
|shima|  23|         2| 18000|
| sima|null|      null| 40000|
| null|  34|        10| 38000|
| null|  36|      null|  null|
+-----+----+----------+------+

In [51]:
#Subset
#optional list of column names to consider.
df_pyspark.na.drop(how="any",subset=['Age']).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
| null| 34|        10| 38000|
| null| 36|      null|  null|
+-----+---+----------+------+

In [60]:
df_pyspark.show()

+-----+----+----------+------+
| Name| age|Experience|Salary|
+-----+----+----------+------+
|mahsa|  31|        10| 30000|
| sara|  30|         8| 25000|
| mina|  29|         4| 20000|
|sahar|  24|         3| 20000|
| homa|  21|         1| 15000|
|shima|  23|         2| 18000|
| sima|null|      null| 40000|
| null|  34|        10| 38000|
| null|  36|      null|  null|
+-----+----+----------+------+

In [68]:
#Filling the Missing Value
#df_pyspark.na.fill('Missing Values',['age']).show()
df_pyspark.na.fill(value=0,subset=["age"]).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
| sima|  0|      null| 40000|
| null| 34|        10| 38000|
| null| 36|      null|  null|
+-----+---+----------+------+

In [69]:
#Replace 0 for null for all integer columns
df_pyspark.na.fill(value=0).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|mahsa| 31|        10| 30000|
| sara| 30|         8| 25000|
| mina| 29|         4| 20000|
|sahar| 24|         3| 20000|
| homa| 21|         1| 15000|
|shima| 23|         2| 18000|
| sima|  0|         0| 40000|
| null| 34|        10| 38000|
| null| 36|         0|     0|
+-----+---+----------+------+

In [73]:
#column name with value “unknown
df_pyspark.na.fill("unknown",['name']).show()

+-------+----+----------+------+
|   Name| age|Experience|Salary|
+-------+----+----------+------+
|  mahsa|  31|        10| 30000|
|   sara|  30|         8| 25000|
|   mina|  29|         4| 20000|
|  sahar|  24|         3| 20000|
|   homa|  21|         1| 15000|
|  shima|  23|         2| 18000|
|   sima|null|      null| 40000|
|unknown|  34|        10| 38000|
|unknown|  36|      null|  null|
+-------+----+----------+------+

In [74]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age', 'Experience', 'Salary'], 
    outputCols=["{}_imputed".format(c) for c in ['age', 'Experience', 'Salary']]
    ).setStrategy("median")

In [75]:
# Add imputation cols to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-----+----+----------+------+-----------+------------------+--------------+
| Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+-----+----+----------+------+-----------+------------------+--------------+
|mahsa|  31|        10| 30000|         31|                10|         30000|
| sara|  30|         8| 25000|         30|                 8|         25000|
| mina|  29|         4| 20000|         29|                 4|         20000|
|sahar|  24|         3| 20000|         24|                 3|         20000|
| homa|  21|         1| 15000|         21|                 1|         15000|
|shima|  23|         2| 18000|         23|                 2|         18000|
| sima|null|      null| 40000|         29|                 4|         40000|
| null|  34|        10| 38000|         34|                10|         38000|
| null|  36|      null|  null|         36|                 4|         20000|
+-----+----+----------+------+-----------+------------------+--------------+